A temporary workaroud is to manually remove the resource from the state the reimport it (while still using new `5.4.0` version), e.g.:
1. `tofu state rm cloudflare_turnstile_widget.test`
2. `tofu import cloudflare_turnstile_widget.test "<account_id>/0x4AAAAAABc5QPJQkE2nXYAs"`

This seems to revolve the error and the updated state now contains `sitekey` attribute for this resource. The docs do not mention this though - https://registry.terraform.io/providers/cloudflare/cloudflare/latest/docs/guides/version-5-upgrade - would be nice to have it there as well

However, now on `plan\apply` this will always produce diff (even after applying once):
```
  # cloudflare_turnstile_widget.test will be updated in-place
  ~ resource "cloudflare_turnstile_widget" "test" {
      ~ bot_fight_mode  = false -> (known after apply)
      - clearance_level = "no_clearance" -> null
      ~ created_on      = "2025-05-13T09:46:23Z" -> (known after apply)
      - ephemeral_id    = false -> null
        id              = "0x4AAAAAABc5QPJQkE2nXYAs"
      ~ modified_on     = "2025-05-13T10:42:22Z" -> (known after apply)
        name            = "test1"
      ~ offlabel        = false -> (known after apply)
      ~ secret          = "ACTUAL_SECRET" -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```